In [3]:
import pandas as pd

In [ ]:
Nombres: Ana, Luis, carlos, maria, pedro
Edad: 23, 25, 22, 24, 26
Cuidad: Quito, Guayaquil, Cuenca, Manta, Quito
Salario: 1200, 1500, 1100, 1300, 1400

In [4]:
df = pd.DataFrame({"Nombres": ["Ana", "Luis", "Carlos", "Maria", "Pedro"],
                     "Edad": [23, 25, 22, 24, 26],
                        "Cuidad": ["Quito", "Guayaquil", "Cuenca", "Manta", "Quito"],
                            "Salario": [1200, 1500, 1100, 1300, 1400]})

df

  Nombres  Edad     Cuidad  Salario
0     Ana    23      Quito     1200
1    Luis    25  Guayaquil     1500
2  Carlos    22     Cuenca     1100
3   Maria    24      Manta     1300
4   Pedro    26      Quito     1400

In [5]:
empleados_mayores_23 = df.loc[df["Edad"] > 23]
empleados_mayores_23

  Nombres  Edad     Cuidad  Salario
1    Luis    25  Guayaquil     1500
3   Maria    24      Manta     1300
4   Pedro    26      Quito     1400

In [ ]:
empleados_quito_mayor_1200 = df.loc[(df["Cuidad"] == "Quito") & (df["Salario"] > 1200)]
empleados_quito_mayor_1200

## con 2 condiciones
## variables

  Nombres  Edad Cuidad  Salario
4   Pedro    26  Quito     1400

In [13]:
salario_anual_empleado = df.loc[:, "Salario"] * 12
salario_anual_empleado

0    14400
1    18000
2    13200
3    15600
4    16800
Name: Salario, dtype: int64

In [11]:
cuidad_salario_mejor_pagado = df.loc[df["Salario"].idxmax(), ["Cuidad", "Salario"]]
cuidad_salario_mejor_pagado

Cuidad     Guayaquil
Salario         1500
Name: 1, dtype: object

In [ ]:
#apply